/* Шаг 1: Рисуем верхнюю границу
Что нужно сделать:

Определите ширину прямоугольника. Это количество звездочек, которые будут выведены в первой строке. Например, если ширина прямоугольника равна 10, вам нужно вывести 10 звездочек подряд.
Создайте цикл, который пройдет от 1 до ширины прямоугольника. В каждой итерации цикла выводите одну звездочку *.
После завершения этого цикла добавьте перенос строки (<br>), чтобы перейти к следующей строке. 
/* Шаг 2: Рисуем пустые строки
Что нужно сделать:

Определите высоту прямоугольника. Это количество строк, включая верхнюю и нижнюю границы. Например, если высота равна 5, вы должны нарисовать 3 пустые строки между верхней и нижней границами.
Создайте внешний цикл для прохода по высоте минус 2. Это количество пустых строк между верхней и нижней границами.
Например, если высота равна 5, цикл будет проходить от 1 до 3 (5 - 2 = 3).
Внутри этого цикла, нарисуйте левую границу строки: выведите символ *.
Создайте внутренний цикл для создания пустого пространства: этот цикл должен проходить от 1 до ширины минус 2. Это пространство между границами.
После внутреннего цикла, выведите правую границу строки: еще одну звездочку *.
Добавьте перенос строки (<br>) после завершения внутреннего цикла, чтобы перейти к следующей строке. 
 Шаг 3: Рисуем нижнюю границу
Что нужно сделать:

Используйте тот же цикл, что и в Шаге 1, чтобы нарисовать нижнюю границу. Это будет такой же цикл, который рисует верхнюю границу.
После завершения этого цикла добавьте перенос строки (<br>), чтобы завершить рисование. */
const width = parseFloat(prompt('Введите ширину'));
const height = parseFloat(prompt('Введите высоту'));
for(let a = 0; a < width; a++) {
    document.write('*');
}
document.write('<br>');
for(let c = 0; c < height - 2; c++) {
    document.write('*');
    for(let d = 1; d < width - 1; d++) {
        document.write('&nbsp;&nbsp;');
    }
    document.write('*');
    document.write('<br>');
}
for(let e = 0; e < width; e++) {
    document.write('*');
}
